[
  "obsidian-excalidraw-plugin",
  "obsidian-auto-link-title",
  "omnisearch",
  "obsidian-vimrc-support",
  "obsidian-kanban",
  "chronology",
  "floating-toc",
  "markdown-table-editor",
  "editor-width-slider",
  "another-sticky-headings",
  "surfing"
]