tap "homebrew/bundle"
brew "code-server"
brew "colima"
brew "cowsay"
brew "docker"
brew "htop"
brew "mas"
brew "minikube"
brew "tmux"
brew "watch"
cask "appcleaner"
cask "devtoys"
cask "keycast"
cask "remote-desktop-manager"
cask "visual-studio-code"
mas "Goodnotes", id: 1444383602
mas "KakaoTalk", id: 869223134
mas "Microsoft Remote Desktop", id: 1295203466
mas "Notability", id: 360593530
vscode "github.remotehub"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-kubernetes-tools.kind-vscode"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "redhat.vscode-yaml"
vscode "sandipchitale.vscode-kubewatch"
vscode "venthe.fauxpilot"
vscode "vscodevim.vim"
