###########################################################################################
## Mac 초기 세팅 할때 xcode-select 사용 or Homebrew 사용
#1. xcode-select
#`$ xcode-select --install && git --version # Command Line Developer tools는 git 포함 여러 툴이 포함되어 있음.`
#2. Homebrew
#`/bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)" && brew install git && git --version`
#
#
### Reference
#- [맥에서 명령어 라인 도구(Command Line Tools) 설치하는 방법](https://www.lainyzine.com/ko/article/how-to-install-command-line-tools-on-macos/)
#- [MacOS에서 Git 설치하는 방법](https://www.lainyzine.com/ko/article/how-to-install-latest-version-of-git-on-macos/)
###########################################################################################

# tap
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"

# brew
brew "mas"
brew "asdf"
brew "code-server"
brew "docker"
brew "docker-compose"
brew "colima"
brew "minikube"
brew "tmux"
brew "tree"
brew "telnet"
brew "wget"
brew "trash-cli"
brew "neovim"
brew "bat"
brew "tig"
brew "lazygit"
brew "git"
brew "tldr"
brew "neofetch"
brew "ripgrep"
brew "btop"
brew "lsd" #brew "exa"
brew "fasd"
brew "fd"
brew "fzf"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubectl"
brew "helm"
brew "nvim"
brew "duf"
brew "dust"
brew "helix"
brew "jesseduffield/lazydocker/lazydocker"
brew "daipeihust/tap/im-select"
# brew "zsh" # mac default shell
# brew "krew"
# brew "htop"
# brew "zellij"
# brew "zoxide"
# pyenv
#brew "pyenv"
#brew "pyenv-virtualenv"
#brew "mackup" # [GitHub - lra/mackup: Keep your application settings in sync (OS X/Linux)](https://github.com/lra/mackup)
# brew "mrkai77/cask/loop" # window manager
# 나중에 shortcut 활용할 일이 있을 때
# brew "koekeishiya/formulae/skhd"


# cask
cask "raycast"
cask "visual-studio-code"
cask "appcleaner"
cask "arc"
cask "google-chrome"
cask "brave-browser"
cask "postman"
cask "heynote"
cask "iterm2"
cask "itsycal"
cask "keka"
cask "github"
cask "sourcetree"
cask "logi-options-plus"
cask "microsoft-remote-desktop"
cask "remote-desktop-manager"
cask "shottr"
cask "termius"
cask "devtoys"
cask "maccy"
cask "datagrip"
cask "cheatsheet"
cask "dropzone"
cask "obsidian"
cask "contexts"
cask "deepl"
cask "homebrew/cask-fonts/font-jetbrains-mono"
cask "homebrew/cask-fonts/font-jetbrains-mono-nerd-font"
# cask "intellij-idea" # or intellij-idea-ce
# cask "pycharm" # or pycharm-ce
# cask "command-x"
# cask "firefox"
# cask "emacs"
# cask "keycastr"
# cask "anydesk"
# cask "topnotch"
# cask "openlens" # or lens 
# cask "tabby"
# cask "cursor"
# cask "bartender"
# cask "fig"
# cask "zed"
# for network
# cask "burp-suite"
# cask "wireshark"
# cask "docker" # colima와 함께 사용하는 거 비추, socket path 이슈
# cask "cyberduck"
# cask "alacritty"
# cask "kitty"
# cask "mate-translate" -> 유료화
# cask "forklift" -> 유료
# cask "alt-tab"
# cask "dash" #
# cask "filezilla" # cask는 아니지만 ftp client

# mas "zest" # 한국에서 다운로드 불가능한 듯 -> https://zestdocs.github.io/ 에서 다운 가능
mas "Goodnotes", id: 1444383602
mas "KakaoTalk", id: 869223134
mas "Microsoft Remote Desktop", id: 1295203466
mas "Notability", id: 360593530
mas "Amphetamine", id: 937984704
mas "RunCat", id: 1429033973
mas "Xmenu", id: 419332741
