###########################################################################################
## Mac 초기 세팅 할때 xcode-select 사용 or Homebrew 사용
#1. xcode-select
#`$ xcode-select --install && git --version # Command Line Developer tools는 git 포함 여러 툴이 포함되어 있음.`
#2. Homebrew
#`/bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)" && brew install git && git --version`
#
#
### Reference
#- [맥에서 명령어 라인 도구(Command Line Tools) 설치하는 방법](https://www.lainyzine.com/ko/article/how-to-install-command-line-tools-on-macos/)
#- [MacOS에서 Git 설치하는 방법](https://www.lainyzine.com/ko/article/how-to-install-latest-version-of-git-on-macos/)
###########################################################################################

# tap
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "hamidnazari/jetbrains-versions"
tap "daipeihust/tap"
# tap "jesseduffield/lazydocker"
# tap "homebrew/core" #ERROR: Tapping homebrew/core is no longer typically necessary

# brew
brew "mas"
brew "asdf"
brew "code-server"
brew "docker"
brew "docker-compose"
brew "colima"
brew "tmux"
brew "tree"
brew "telnet"
brew "wget"
brew "trash-cli"
brew "neovim"
brew "bat"
brew "git"
brew "tldr"
brew "neofetch"
brew "ripgrep"
brew "btop"
brew "lsd" #brew "exa"
brew "fd"
brew "fzf"
brew "jq"
brew "helix"
brew "nvim"
brew "kubectl"
brew "duf"
brew "dust"
brew "thefuck"
brew "mackup" # [GitHub - lra/mackup: Keep your application settings in sync (OS X/Linux)](https://github.com/lra/mackup)
brew "im-select" # brew "daipeihust/tap/im-select"
brew "pyright" # python lsp

# brew "ffmpeg"
# brew "fasd"
# GIT
# brew "tig"
# brew "lazygit"
# CONTAINER
# brew "minikube"
# brew "k9s"
# brew "kubectx"
# brew "helm"
# brew "jesseduffield/lazydocker/lazydocker"
# brew "krew"
# brew "htop"
# brew "zellij"
# brew "zoxide"
# pyenv
# brew "pyenv"
# brew "pyenv-virtualenv"
# brew "mrkai77/cask/loop" # window manager
# brew "zsh" # mac default shell
# 나중에 shortcut 활용할 일이 있을 때
# brew "koekeishiya/formulae/skhd"


# cask
cask "raycast"
cask "visual-studio-code"
cask "appcleaner"
cask "arc"
cask "google-chrome"
cask "brave-browser"
cask "postman"
cask "heynote"
cask "iterm2"
cask "itsycal"
cask "keka"
cask "github"
cask "sourcetree"
cask "logi-options-plus"
cask "microsoft-remote-desktop"
cask "remote-desktop-manager"
cask "shottr" # 구매하지 않으면 앱 시작시 팝업이 뜨지만 무료라 참는다.
cask "termius"
cask "devtoys"
cask "maccy"
cask "cheatsheet"
cask "dropzone"
cask "obsidian"
cask "contexts"
cask "deepl"
cask "zed"
cask "syntax-highlight" # brew install --cask --no-quarantine syntax-highlight # https://github.com/sbarex/SourceCodeSyntaxHighlight 
cask "homebrew/cask-fonts/font-jetbrains-mono"
cask "homebrew/cask-fonts/font-jetbrains-mono-nerd-font"

# JETBRAINS
# cask "goland@2022.3.4"
# cask "pycharm@2022.3.3"
# cask "datagrip@2022.3.3"
# cask "intellij-idea@2022.3.3"
# cask "intellij-idea" # or intellij-idea-ce
# cask "pycharm" # or pycharm-ce
# cask "datagrip"

# cask "qlmarkdown" # https://github.com/sbarex/QLMarkdown
# cask "command-x"
# cask "firefox"
# cask "emacs"
# cask "keycastr"
# cask "anydesk"
# cask "topnotch"
# cask "openlens" # or lens 
# cask "tabby"
# cask "cursor"
# cask "bartender"
# cask "fig"
# FOR NETWORK
# cask "burp-suite"
# cask "wireshark"
# cask "docker" # colima와 함께 사용하는 거 비추, socket path 이슈
# cask "cyberduck"
# cask "alacritty"
# cask "kitty"
# cask "alt-tab"
# cask "flameshot"
# cask "dbeaver-community"
# cask "mate-translate" # -> 유료화
# cask "forklift" # -> 유료
# cask "dash" # -> 유료
# cask "filezilla" # cask는 아니지만 ftp client

mas "KakaoTalk", id: 869223134
mas "RunCat", id: 1429033973
# mas "zest" # 한국에서 다운로드 불가능한 듯 -> https://zestdocs.github.io/ 에서 다운 가능
# mas "Xmenu", id: 419332741
# mas "Amphetamine", id: 937984704
# mas "Notability", id: 360593530
# mas "Goodnotes", id: 1444383602
# mas "Microsoft Remote Desktop", id: 1295203466
