###########################################################################################
# _                        __ _ _
# | |                      / _(_) |
# | |__  _ __ _____      _| |_ _| | ___
# | '_ \| '__/ _ \ \ /\ / /  _| | |/ _ \
# | |_) | | |  __/\ V  V /| | | | |  __/
# |_.__/|_|  \___| \_/\_/ |_| |_|_|\___|
# BREWFILE
## Mac 초기 세팅
# Homebrew
#`/bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)" && brew install git && git --version`
###########################################################################################

# tap
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "hamidnazari/jetbrains-versions"
tap "daipeihust/tap"
# tap "jesseduffield/lazydocker"
# tap "homebrew/core" #ERROR: Tapping homebrew/core is no longer typically necessary

# brew
brew "mas"
# brew "git"
brew "httpie"
# brew "asdf"
# brew "mise"
# brew "code-server"
brew "docker"
# brew "docker-compose"
# brew "devcontainer"
brew "colima" #, restart_service: true # macOS용 컨테이너 런타임 (Docker 대체) 
# brew "ollama"
brew "gh"
# gh copilot
# https://docs.github.com/en/copilot/managing-copilot/configure-personal-settings/installing-github-copilot-in-the-cli, 
# https://docs.github.com/en/copilot/using-github-copilot/using-github-copilot-in-the-command-line

# brew "devpod"
# brew "orbstack"
# curl -fsSL https://get.jetify.com/devbox | bash
brew "tmux"
brew "tree"
brew "telnet"
brew "trash-cli"
brew "neovim"
brew "tldr"
brew "neofetch"
brew "ripgrep"
brew "btop"
brew "macmon"             # macOS 시스템 모니터링
# brew "mactop"           # macOS 시스템 모니터링
brew "lsd"
brew "fd"
brew "fzf"
# brew "atuin"
brew "jq"                 # JSON
brew "fx"                 # JSON
brew "sshs"
# brew "newman"
# brew "otree"
# brew "noahgorstein/tap/jqp"
# brew "serpl"            # JSON/YAML # Should build binary => https://github.com/yassinebridi/serpl
# brew "tabiew"
brew "helix"
# brew "bash"             # mac default bash(/bin/bash)는 버전이 낮음. symlink도 걸어줘야하나..
# brew "nushell"
# brew "direnv"
# brew "kubectl"
brew "duf"
brew "dust"
# brew "wget"
# brew "thefuck"
brew "mackup"
brew "im-select"
brew "bpython"
# brew "stow"
# brew "ranger"
brew "superfile"

#LSP
brew "bash-language-server"
brew "pyright"              # python lsp
# brew "golang"
brew "gopls"
brew "node"          # Node.js + npm + npx
brew "nvm"           # Node Version Manager
# brew "bat"
# brew "grpc"
# brew "grpcui"
# brew "grpcurl"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "bash-language-server"
brew "dockerfile-language-server"
brew "marksman"
brew "typescript-language-server"
brew "kotlin-language-server"
brew "jdtls"
brew "taplo"

# brew "ffmpeg"
# brew "fasd"
# GIT
# brew "tig"
# brew "lazygit"
# CONTAINER
# brew "minikube"
# brew "k9s"
# brew "kubectx"
# brew "helm"
# brew "argocd"
# brew "jesseduffield/lazydocker/lazydocker"
# brew "krew"
# brew "htop"
# brew "zellij"
# brew "zoxide"
# PYENV
# brew "pyenv"
# brew "pyenv-virtualenv"
# brew "mrkai77/cask/loop"  # window manager
# brew "zsh"
# 나중에 shortcut 활용할 일이 있을 때
# brew "koekeishiya/formulae/skhd"

# ANALYSIS or Hacking
# brew "termshark"          # Wireshark
# brew "tcpdump"
# brew "nmap"
# brew "httpflow"
# brew "tcpreply"
# brew "tcptrace"
# brew "whireshark"
# brew "aircrack-ng"        # 네트워크 보안
# brew "tailscale"

# CLOUD
# brew "terraform"
# AWS
# https://docs.aws.amazon.com/cli/latest/userguide/getting-started-install.html
# GCP
# https://cloud.google.com/sdk/docs/install?hl=ko
# AZURE
# brew "azure-cli"
# https://learn.microsoft.com/ko-kr/cli/azure/install-azure-cli
# CASK
cask "raycast"
cask "visual-studio-code"
# cask "appcleaner"
# cask "chatgpt"
# cask "perplexity"
# cask "claude"
# cask "arc"
# cask "zen-browser"
cask "google-chrome"
# cask "brave-browser"
cask "microsoft-edge"
# cask "microsoft-edge@dev"
# cask "postman"
# cask "apidog"
# cask "heynote"
cask "httpie"
cask "iterm2"
cask "warp"
# cask "wave"
cask "itsycal"
# cask "ghostty"
# cask "keka"
# cask "github"
# cask "sourcetree"
# cask "logi-options-plus"
# cask "microsoft-remote-desktop"
# cask "remote-desktop-manager"
cask "shottr"               # 구매하지 않으면 앱 시작시 팝업이 뜨지만 무료라 참는다.
# cask "termius"
# cask "cakebrew"           # Homebrew GUI
# cask "cakebrewjs"         # Homebrew GUI (JS)
cask "devtoys"
cask "maccy"
cask "cheatsheet"
cask "dropzone"
cask "obsidian"
cask "google-drive"
# cask "jump-desktop-connect"
# cask "reflect"            # 노트
# "reor"                    # 노트 # no brew app
cask "contexts"
cask "deepl"
# cask "one-switch"
# cask "zed"
# cask "drawio"
# cask "removebg"
# cask "karabiner-elements"
cask "rocket"               # emoji shortcut
cask "syntax-highlight"     # 파일 미리보기 # brew install --cask --no-quarantine syntax-highlight # https://github.com/sbarex/SourceCodeSyntaxHighlight
cask "homebrew/cask-fonts/font-jetbrains-mono"
cask "homebrew/cask-fonts/font-jetbrains-mono-nerd-font"
# cask "hazeover"           # 창 투명도 조절
# cask "flux"               # 화면 색상 조절
# cask "Upscalyl"           # 사진 해상도 조절(upscaling)
# cask "cleanmymac"
# cask "rewind"             # 화면 기록 및 검색
# cask "steam"
# cask "msk"                # 키보드 단축키 표시 # https://github.com/x0054/MKS

# JETBRAINS
# cask "goland@2022.3.4"
# cask "pycharm@2022.3.3"
# cask "datagrip@2022.3.3"
# cask "intellij-idea@2022.3.3"
# cask "intellij-idea"
# cask "pycharm"
# cask "datagrip"

# KUBERNETES
# cask "openlens"
# cask "aptakube"
# cask "kubernetic"
# cask "headlamp"
# cask "kubewall/tap/kubewall"

# cask "qlmarkdown"         # 마크다운 파일 미리보기 # https://github.com/sbarex/QLMarkdown
# cask "command-x"          # 파일 이동 단축키
# cask "firefox"
# cask "emacs"
# cask "keycastr"           # 키 입력 표시
# cask "anydesk"
# cask "topnotch"
# cask "tabby"
# cask "cursor"
# cask "bartender"          # 메뉴바 아이콘 관리
# cask "hiddenbar"          # 메뉴바 아이콘 숨김
# cask "fig"                # 터미널 자동완성

# FOR NETWORK
# cask "burp-suite"
# cask "wireshark"
# cask "docker"
# cask "cyberduck"          # FTP/SFTP 클라이언트
# cask "alacritty"
# cask "kitty"
# cask "alt-tab"
# cask "flameshot"
# cask "dbeaver-community"
# cask "mate-translate"
# cask "forklift"
# cask "dash"
# cask "filezilla"
# cask "sidenotes"
# cask "murus"             # pf 방화벽 gui
# cask "tailscale"         # vpn  

# File Sync
# brew "unison"
# cask "unison"

# FOR LLM
# cask "notesollama"
# cask "ollama"
# cask "lm-studio"

# FOR KEYBOARD
# cask "via"
# cask "vial"
# cask "linearmouse"

# APP STORE APPS
mas "KakaoTalk", id: 869223134      
mas "RunCat", id: 1429033973        
mas "Tailscale", id: 1475387142
# mas "zest"                        # 한국에서 다운로드 불가능한 듯 -> https://zestdocs.github.io/ 에서 다운 가능
# mas "DropOver", id: 1355679052    # 유료
# mas "Xmenu", id: 419332741        
# mas "Amphetamine", id: 937984704  
# mas "Notability", id: 360593530   
# mas "Goodnotes", id: 1444383602  
# mas "Microsoft Remote Desktop", id: 1295203466 
# mas "Translation Tooltip", id: 1591769658 
# mas "Tip", id: 1495732622
# mas "Xcode", id: 497799835
# mas "One Thing", id: 1604176982
# mas "Spaced", id: 1666327168
# mas "1Password", id: 1333542190
# mas "Parallels Desktop", id: 1085114709
# mas "Screens 5: VNC 원격 데스크톱", id: 1663047912
mas "Card Diary", id: 1536247273
# VSCODE
# vscode "vscodevim.vim"
