###########################################################################################
# _                        __ _ _      
# | |                      / _(_) |     
# | |__  _ __ _____      _| |_ _| | ___ 
# | '_ \| '__/ _ \ \ /\ / /  _| | |/ _ \
# | |_) | | |  __/\ V  V /| | | | |  __/
# |_.__/|_|  \___| \_/\_/ |_| |_|_|\___|
# BREWFILE
## Mac 초기 세팅 할때 xcode-select 사용 or Homebrew 사용
#1. xcode-select
#`$ xcode-select --install && git --version # Command Line Developer tools는 git 포함 여러 툴이 포함되어 있음.`
#2. Homebrew
#`/bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)" && brew install git && git --version`
#
#
### Reference
#- [맥에서 명령어 라인 도구(Command Line Tools) 설치하는 방법](https://www.lainyzine.com/ko/article/how-to-install-command-line-tools-on-macos/)
#- [MacOS에서 Git 설치하는 방법](https://www.lainyzine.com/ko/article/how-to-install-latest-version-of-git-on-macos/)
###########################################################################################

# tap
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "hamidnazari/jetbrains-versions"
tap "daipeihust/tap"
# tap "jesseduffield/lazydocker"
# tap "homebrew/core" #ERROR: Tapping homebrew/core is no longer typically necessary

# brew
brew "mas"
brew "httpie"
brew "asdf"
brew "code-server" #, restart_service: true
brew "docker"
brew "devpod"
brew "docker-compose"
brew "colima" #, restart_service: true
brew "tmux"
brew "tree"
brew "telnet"
brew "trash-cli"
brew "neovim"
brew "tldr"
brew "neofetch"
brew "ripgrep"
brew "btop"
brew "lsd" #brew "exa"
brew "fd"
brew "fzf"
brew "jq"
brew "fx"
# brew newman
# brew "otree"
# brew "noahgorstein/tap/jqp"
# brew "serpl" # Should build binary => https://github.com/yassinebridi/serpl
# brew "tabiew" # Should build binary => https://github.com/shshemi/tabiew
brew "helix"
brew "bash" # mac default bash(/bin/bash)는 버전이 낮음. symlink도 걸어줘야하나..
# brew "direnv"
# brew "kubectl"
brew "duf"
brew "dust"
# brew "wget"
# brew "thefuck"
brew "mackup" # [GitHub - lra/mackup: Keep your application settings in sync (OS X/Linux)](https://github.com/lra/mackup)
brew "im-select" # brew "daipeihust/tap/im-select"
# brew "stow" # for dotfiles symlink
#LSP
brew "bash-language-server"
brew "pyright" # python lsp
brew "golang"
brew "gopls"
brew "nvm"
# brew "bat"
# brew "git" # xcode-select로 해결
# brew "grpc"
# brew "grpcui"
# brew "grpcurl"

# brew "ffmpeg"
# brew "fasd"
# GIT
# brew "tig"
# brew "lazygit"
# CONTAINER
# brew "minikube"
# brew "k9s"
# brew "kubectx"
# brew "helm"
# brew "argocd"
# brew "jesseduffield/lazydocker/lazydocker"
# brew "krew"
# brew "htop"
# brew "zellij"
# brew "zoxide"
# PYENV
# brew "pyenv"
# brew "pyenv-virtualenv"
# brew "mrkai77/cask/loop" # window manager
# brew "zsh" # mac default shell
# 나중에 shortcut 활용할 일이 있을 때
# brew "koekeishiya/formulae/skhd"

# ANALYSIS or Hacking
# brew "tcpdump"
# brew "nmap"
# brew "httpflow"
# brew "tcpreply"
# brew "tcptrace"
# brew "whireshark"
# brew "aircrack-ng"

# CLOUD
# brew terraform
# AWS
# https://docs.aws.amazon.com/cli/latest/userguide/getting-started-install.html
# GCP
# https://cloud.google.com/sdk/docs/install?hl=ko
# AZURE
# brew "azure-cli"
# https://learn.microsoft.com/ko-kr/cli/azure/install-azure-cli

# CASK
cask "raycast"
cask "visual-studio-code"
# cask "appcleaner" # raycast 기능으로 대체 가능
# cask "chatgpt"
# cask "arc" # mobile과의 연동성 + multi device 사용시 열려있던 tab이 갑자기 모두 닫히는 이유 + 업데이트 이후 급 성능이슈 일단 사용중지
cask "google-chrome"
# cask "brave-browser" # 사내 내규상 사용불가
cask "microsoft-edge"
# cask "microsoft-edge@dev"
# cask "postman"
# cask "apidog"
# cask "heynote"
cask "httpie"
cask "iterm2"
cask "itsycal"
# cask "keka"
# cask "github"
# cask "sourcetree"
cask "logi-options-plus"
# cask "microsoft-remote-desktop"
# cask "remote-desktop-manager"
cask "shottr" # 구매하지 않으면 앱 시작시 팝업이 뜨지만 무료라 참는다.
# cask "termius"
cask "cakebrew"
cask "cakebrewjs"
cask "devtoys"
cask "maccy"
cask "cheatsheet"
cask "dropzone"
cask "obsidian"
cask "contexts"
cask "deepl"
cask "zed"
cask "drawio"
cask "removebg"
cask "karabiner-elements"
cask "rocket" # emoji shortcut
cask "syntax-highlight" # brew install --cask --no-quarantine syntax-highlight # https://github.com/sbarex/SourceCodeSyntaxHighlight 
cask "homebrew/cask-fonts/font-jetbrains-mono"
cask "homebrew/cask-fonts/font-jetbrains-mono-nerd-font"
# cask "hazeover" # 창 투명도 조절
# cask "flux" # 화면 색상 조절
# cask "Upscalyl" # 사진 해상도 조절(upscaling)
# cask "cleanmymac" # 유료
# cask "rewind"
# cask "steam"

# JETBRAINS
# cask "goland@2022.3.4"
# cask "pycharm@2022.3.3"
# cask "datagrip@2022.3.3"
# cask "intellij-idea@2022.3.3"
# cask "intellij-idea" # or intellij-idea-ce
# cask "pycharm" # or pycharm-ce
# cask "datagrip"

# KUBERNETES
# cask "openlens" # or lens 
# cask "aptakube"
# cask "kubernetic"
# cask 'headlamp'

# cask "qlmarkdown" # https://github.com/sbarex/QLMarkdown
# cask "command-x"
# cask "firefox"
# cask "emacs"
# cask "keycastr"
# cask "anydesk"
# cask "topnotch"
# cask "tabby"
# cask "cursor"
# cask "bartender"
# cask "hiddenbar"
# cask "fig"

# FOR NETWORK
# cask "burp-suite"
# cask "wireshark"
# cask "docker" # colima와 함께 사용하는 거 비추, socket path 이슈
# cask "cyberduck"
# cask "alacritty"
# cask "kitty"
# cask "alt-tab"
# cask "flameshot"
# cask "dbeaver-community"
# cask "mate-translate" # -> 유료화
# cask "forklift" # -> 유료
# cask "dash" # -> 유료
# cask "filezilla" # cask는 아니지만 ftp client
# cask "sidenotes"

# File Sync
# brew "unison"
# cask "unison"

# FOR LLM
# cask "notesollama"
# cask "lm-studio"

# FOR KEYBOARD
# cask "via"
# cask "vial"
# cask "linearmouse" #mouse accelerator

mas "KakaoTalk", id: 869223134
mas "RunCat", id: 1429033973
# mas "zest" # 한국에서 다운로드 불가능한 듯 -> https://zestdocs.github.io/ 에서 다운 가능
# mas "DropOver", id: 1355679052 # 유료
# mas "Xmenu", id: 419332741
# mas "Amphetamine", id: 937984704
# mas "Notability", id: 360593530
# mas "Goodnotes", id: 1444383602
# mas "Microsoft Remote Desktop", id: 1295203466
# mas "Translation Tooltip", id: 1591769658
# mas "Tip", id: 1495732622
# mas "Xcode", id: 497799835
# mas "One Thing", id: 1604176982  
# mas "Spaced", id: 1666327168  
# mas "Card Diary", id: 1536247273
# VSCODE
# vscode "vscodevim.vim"